UnhideElements Method
Sets the elements to be shown in the given view if they are currently hidden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void UnhideElements(
	ICollection<ElementId> elementIdSet
)
Visual Basic
Public Sub UnhideElements ( _
	elementIdSet As ICollection(Of ElementId) _
)
Visual C++
public:
void UnhideElements(
	ICollection<ElementId^>^ elementIdSet
)
Parameters
elementIdSet
Type: System.Collections.GenericICollectionElementId
A set of ElementIds to be unhidden.
Remarks
This change is permanent until the elements are hidden again. All elements in the set must be currently hidden. An application can check this with IsHidden(View).
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException | Thrown when argument is a null reference (Nothing in Visual Basic).
Autodesk.Revit.ExceptionsArgumentException | Thrown when the set of elements to be unhidden is empty or one of the elements can not be unhidden.
Autodesk.Revit.ExceptionsInvalidOperationException | Thrown when document regeneration failed.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →